# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 5 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 316 layers, 2,275,386 parameters, 2,275,386 gradients, 5.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 316 layers, 8,994,586 parameters, 8,994,586 gradients, 21.5 GFLOPs
  m: [0.50, 1.00, 512] # summary: 336 layers, 20,505,882 parameters, 20,505,882 gradients, 72.7 GFLOPs
  l: [1.00, 1.00, 512] # summary: 484 layers, 24,074,010 parameters, 24,074,010 gradients, 89.5 GFLOPs
  x: [1.00, 1.50, 512] # summary: 484 layers, 54,036,346 parameters, 54,036,346 gradients, 200.2 GFLOPs

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_SHSA, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2_SHSA, [1024, True]]
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2_CACS, [512, True]] # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2_CACS, [256, True]] # 16 (P3/8-small)
  - [-1, 1, EMCA_attention, [256]] # 17

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2_CACS, [512, True]] # 20 (P4/16-medium)
  - [-1, 1, EMCA_attention, [512]] # 21

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 1, C3k2_CACS, [1024, True, 0.5, True]] # 24 (P5/32-large)
  - [-1, 1, EMCA_attention, [1024]] # 25

  - [[17, 21, 25], 1, Detect, [nc]] # Detect(P3, P4, P5)